exosite-garage/CC3200CloudDemo/exosite_cloud_demo_for_cc3200/main.c
        }
        break;

        case SL_WLAN_STA_CONNECTED_EVENT:
        {
            // when device is in AP mode and any client connects to device cc3xxx


            //
            // Information about the connected client (like SSID, MAC etc) will
            // be available in 'slPeerInfoAsyncResponse_t' - Applications
            // can use it if required
            //
            // slPeerInfoAsyncResponse_t *pEventData = NULL;
            // pEventData = &pSlWlanEvent->EventData.APModeStaConnected;
            //

        }
        break;

        case SL_WLAN_STA_DISCONNECTED_EVENT:
        {
            // when client disconnects from device (AP)


            //
            // Information about the connected client (like SSID, MAC etc) will
            // be available in 'slPeerInfoAsyncResponse_t' - Applications
            // can use it if required
            //
            // slPeerInfoAsyncResponse_t *pEventData = NULL;
            // pEventData = &pSlWlanEvent->EventData.APModestaDisconnected;
            //
        }
        break;

        default:
        {
            UART_PRINT("[WLAN EVENT] Unexpected event \n\r");
        }
        break;
    }
}

//*****************************************************************************
//
//! \brief This function handles network events such as IP acquisition, IP
//!           leased, IP released etc.
//!
//! \param[in]  pNetAppEvent - Pointer to NetApp Event Info
//!
//! \return None
//!
//*****************************************************************************
void SimpleLinkNetAppEventHandler(SlNetAppEvent_t *pNetAppEvent)
{
    switch(pNetAppEvent->Event)
    {
        case SL_NETAPP_IPV4_ACQUIRED:
        case SL_NETAPP_IPV6_ACQUIRED:
        {
            g_ucIpObtained = 1;

        }
        break;

        case SL_NETAPP_IP_LEASED:
        {
        	g_ucIpLeased = 1;

            g_ulStaIp = (pNetAppEvent)->EventData.ipLeased.ip_address;

            UART_PRINT("[NETAPP EVENT] IP Leased to Client: IP=%d.%d.%d.%d , ",
            			SL_IPV4_BYTE(g_ulStaIp,3), SL_IPV4_BYTE(g_ulStaIp,2),
            			SL_IPV4_BYTE(g_ulStaIp,1), SL_IPV4_BYTE(g_ulStaIp,0));
        }
        break;

        default:
        {
            UART_PRINT("[NETAPP EVENT] Unexpected event [0x%x] \n\r",
                       pNetAppEvent->Event);
        }
        break;
    }
}

//*****************************************************************************
//
//! This function gets triggered when HTTP Server receives Application
//! defined GET and POST HTTP Tokens.
//!
//! \param pSlHttpServerEvent - Pointer indicating http server event
//! \param pSlHttpServerResponse - Pointer indicating http server response
//!
//! \return None
//!
//*****************************************************************************
void sl_HttpServerCallback(SlHttpServerEvent_t *pSlHttpServerEvent,
		SlHttpServerResponse_t *pSlHttpServerResponse)
{
    int i = 0;
    switch (pSlHttpServerEvent->Event)
    {
        case SL_NETAPP_HTTPGETTOKENVALUE:
        {

            if(0== memcmp(pSlHttpServerEvent->EventData.httpTokenName.data,
                            g_token_get [0],
                            pSlHttpServerEvent->EventData.httpTokenName.len))
            {
                if(g_ucConnectedToConfAP == 1)
                {
                	// Important - Connection Status
                    memcpy(pSlHttpServerResponse->ResponseData.token_value.data,
                    		"TRUE",strlen("TRUE"));
                    pSlHttpServerResponse->ResponseData.token_value.len =
                    											strlen("TRUE");
                }
                else
                {
                	// Important - Connection Status
                    memcpy(pSlHttpServerResponse->ResponseData.token_value.data,
                    		"FALSE",strlen("FALSE"));
                    pSlHttpServerResponse->ResponseData.token_value.len =
																strlen("FALSE");
                }
            }
           for (i = 0; i < TOKEN_ARRAY_SIZE - 1; i++)
           {
            if (0== memcmp (pSlHttpServerEvent->EventData.httpTokenName.data,
                            g_token_get [i + 1],pSlHttpServerEvent->EventData.httpTokenName.len))
            {
                memcpy (pSlHttpServerResponse->ResponseData.token_value.data,
                        g_NetEntries[i].ssid,g_NetEntries[i].ssid_len); // Important - Token value len should be < MAX_TOKEN_VALUE_LEN
                pSlHttpServerResponse->ResponseData.token_value.data[g_NetEntries[i].ssid_len] = 0;
                pSlHttpServerResponse->ResponseData.token_value.len = g_NetEntries[i].ssid_len;
            }
           }
      }
              break;

      case SL_NETAPP_HTTPPOSTTOKENVALUE:
      {

        if((0 == memcmp(pSlHttpServerEvent->EventData.httpPostData.token_name.data,
                          "__SL_P_USC",
                 pSlHttpServerEvent->EventData.httpPostData.token_name.len)) &&
            (0 == memcmp(pSlHttpServerEvent->EventData.httpPostData.token_value.data,
                          "Add", pSlHttpServerEvent->EventData.httpPostData.token_value.len)))
        {
            g_ucProfileAdded = 0;

        }
        if(0 == memcmp(pSlHttpServerEvent->EventData.httpPostData.token_name.data,
                         "__SL_P_USD", pSlHttpServerEvent->EventData.httpPostData.token_name.len))
        {
            memcpy(g_cWlanSSID,  pSlHttpServerEvent->EventData.httpPostData.token_value.data,
                    pSlHttpServerEvent->EventData.httpPostData.token_value.len);
            g_cWlanSSID[pSlHttpServerEvent->EventData.httpPostData.token_value.len] = 0;
        }

        if(0 == memcmp(pSlHttpServerEvent->EventData.httpPostData.token_name.data,
                         "__SL_P_USE", pSlHttpServerEvent->EventData.httpPostData.token_name.len))
        {

            if(pSlHttpServerEvent->EventData.httpPostData.token_value.data[0] == '0')
            {
                g_SecParams.Type =  SL_SEC_TYPE_OPEN;//SL_SEC_TYPE_OPEN

