exosite-garage/CC3200CloudDemo/exosite_cloud_demo_for_cc3200/main.c
        InitializeAppVariables();

        lRetVal = sl_Start(0, 0, 0);
        ASSERT_ON_ERROR(__LINE__, lRetVal);

        // Check if the device is in station again
        if(ROLE_STA != lRetVal)
        {
            // We don't want to proceed if the device is not up in STA-mode
            return DEVICE_NOT_IN_STATION_MODE;
        }
    }

    //
    // Device in station-mode. Disconnect previous connection if any
    // The function returns 0 if 'Disconnected done', negative number if already
    // disconnected Wait for 'disconnection' event if 0 is returned, Ignore
    // other return-codes
    //
    lRetVal = sl_WlanDisconnect();
    if(0 == lRetVal)
    {
        // Wait
        while(g_ucConnectionStatus == 0)
        {
#ifndef SL_PLATFORM_MULTI_THREADED
              _SlNonOsMainLoopTask();
#endif
        }
    }

    // Enable DHCP client
    lRetVal = sl_NetCfgSet(SL_IPV4_STA_P2P_CL_DHCP_ENABLE,1,1,&ucVal);
    ASSERT_ON_ERROR(__LINE__, lRetVal);

    // Disable scan
    ucConfigOpt = SL_SCAN_POLICY(0);
    lRetVal = sl_WlanPolicySet(SL_POLICY_SCAN , ucConfigOpt, NULL, 0);
    ASSERT_ON_ERROR(__LINE__, lRetVal);

    // Set Tx power level for station mode
    // Number between 0-15, as dB offset from max power - 0 will set max power
    ucPower = 0;
    lRetVal = sl_WlanSet(SL_WLAN_CFG_GENERAL_PARAM_ID,
            WLAN_GENERAL_PARAM_OPT_STA_TX_POWER, 1, (unsigned char *)&ucPower);
    ASSERT_ON_ERROR(__LINE__, lRetVal);

    // Set PM policy to normal
    lRetVal = sl_WlanPolicySet(SL_POLICY_PM , SL_NORMAL_POLICY, NULL, 0);
    ASSERT_ON_ERROR(__LINE__, lRetVal);

    lRetVal = sl_Stop(SL_STOP_TIMEOUT);
    ASSERT_ON_ERROR(__LINE__, lRetVal);

    InitializeAppVariables();

    return lRetVal; // Success
}


//*****************************************************************************
//
//! DeInitDriver
//! The function de-initializes a CC3200 device
//!  
//! \param  None
//!  
//! \return none
//
//*****************************************************************************
void
DeInitDriver(void)
{
    //
    // Disconnect from the AP
    //
    sl_WlanDisconnect();
    //
    // Stop the simplelink host
    //
    sl_Stop(SL_STOP_TIMEOUT);
}

void
DeInitDriverAP(void)
{
    //
    // Stop the simplelink host
    //
    sl_Stop(SL_STOP_TIMEOUT);

}
//*****************************************************************************
//
//! initDriver
//! The function initializes a CC3200 device and triggers it to start operation
//!  
//! \param  None
//!  
//! \return none
//
//*****************************************************************************
int
InitDriver(void)
{
    //
    // Start the simplelink host
    //
    return sl_Start(NULL,NULL,NULL);

}

static void WlanConnect()
{
    //Add Profile
    sl_WlanProfileAdd(g_cWlanSSID, strlen((char*)g_cWlanSSID), 0, &g_SecParams,
    							0,g_ucPriority,0);

    //Connecting to the Access point
    sl_WlanConnect(g_cWlanSSID, strlen((char*)g_cWlanSSID), 0, &g_SecParams, 0);

    //waiting for the device to connect to the AP and obtain ip address
    while(g_uiConnectTimeoutCnt<CONNECTION_TIMEOUT_COUNT &&
    		((g_ucConnectionStatus == 0) || (g_ucIpObtained == 0)))
    {
        osi_Sleep(1); //Sleep 1 millisecond
        g_uiConnectTimeoutCnt++;
    }

    g_uiConnectTimeoutCnt = 0;

}

//*****************************************************************************
//
//! The interrupt handler for the 100ms interrupt.
//!
//! \param  None
//!
//! \return none
//
//*****************************************************************************
void
TimerBaseIntHandler(void)
{
  //
  // Clear the timer interrupt.
  //
  Timer_IF_InterruptClear(TIMERA0_BASE);
  Demo_Tick();
}

//*****************************************************************************
//
//! The interrupt handler for the 100ms interrupt.
//!
//! \param  None
//!
//! \return none
//
//*****************************************************************************
void
TimerA1IntHandler(void)
{
  //
  // Clear the timer interrupt.
  //
  Timer_IF_InterruptClear(TIMERA1_BASE);
  if (GPIOPinRead(GPIOA1_BASE,GPIO_PIN_5)) //sw3
  {
    SW3_Pressed();
  }
  if (GPIOPinRead(GPIOA2_BASE,GPIO_PIN_6)) //sw2
  {
    SW2_Pressed();
  }
}

//****************************************************************************
//
//! Task function implements the ProvisioningAP functionality
//!
//! \param none
//! 
//! This function  
//!    1. Starts Device in STA Mode
//!    2. Scans and Stores all the AP
//!    3. Switch to AP Mode and Wait for AP Configuration from Browser
//!    4. Switch to STA Mode and Connect to Configured AP
//!
//! \return None.
//
//****************************************************************************
void ProvisioningAP(void* pTaskParams)
{

    int iDeviceMode = 0, auto_connect_mode = 0;
    char message[100];
    unsigned long intervalInSeconds = 10;
    char force_ap_mode = 0;

    int Index,i;


    long retVal = -1;

	InitializeAppVariables();

	//
	// Following function configure the device to default state by cleaning
	// the persistent settings stored in NVMEM (viz. connection profiles &
	// policies, power policy etc)
	//
	// Applications may choose to skip this step if the developer is sure
	// that the device is in its default state at start of applicaton
	//
	// Note that all profiles and persistent settings that were done on the
	// device will be lost
	//
	retVal = ConfigureSimpleLinkToDefaultState();
	if(retVal < 0)
	{
	   if (DEVICE_NOT_IN_STATION_MODE == retVal)
		   UART_PRINT("Failed to configure the device in its default state \n\r");

	   LOOP_FOREVER(__LINE__);
	}

	UART_PRINT("Device is configured in default state \n\r");

    // Check SW3, if pressed force AP mode.
    if (GPIOPinRead(GPIOA1_BASE,GPIO_PIN_5)) //sw3
    {
      Report("Forcing into AP Mode\r\n");
      force_ap_mode = 1;
    }
    //
    // Start the driver
    //
    iDeviceMode = InitDriver();
    
    if(iDeviceMode == ROLE_AP)
    {
        //Device in AP Mode, Wait for Initialization to Complete
        while(g_ucIpObtained == 0)
        {
            MAP_UtilsDelay(100); 
        }
    }
    
    sl_WlanSetMode(ROLE_STA);
    

    if(iDeviceMode == ROLE_AP)
    	DeInitDriverAP();
    else
    	DeInitDriver();
    
