exosite-garage/CC3200CloudDemo/exosite_cloud_demo_for_cc3200/main.c
    g_ucIpObtained = 0;
    g_ucConnectionStatus = 0;
    
    //MAP_UtilsDelay(10000000); // wait for scan to append msec
    InitDriver();
    
  
    while(!g_ucProvisioningDone)
    {
        if ((g_cWlanSSID[0] == 0 || g_cWlanSSID[0] == NULL) ||
             ((g_SecParams.Type != SL_SEC_TYPE_OPEN) && (g_cWlanSecurityKey[0] == 0 || g_cWlanSecurityKey[0] == NULL)))
        {
         //Scan AP in STA mode
        sl_WlanPolicySet(SL_POLICY_SCAN,SL_SCAN_POLICY_EN(1), 
                 (unsigned char *)&intervalInSeconds,sizeof(intervalInSeconds));

        // wait for scan to complete
        MAP_UtilsDelay(20000000); 

        //Get Scan Result
        Index = sl_WlanGetNetworkList(0,20,&g_NetEntries[0]);

        for(i=0; i< Index; i++)
        {
             snprintf(message, 60, "%d) SSID %s\n\r",i,g_NetEntries[i].ssid);
				 Report("%d) SSID %s\n\r",i,g_NetEntries[i].ssid);
        }
		Report("Switch back to AP Mode\r\n");
        //Switch to AP Mode
        sl_WlanSetMode(ROLE_AP);

        DeInitDriver();
        g_ucIpObtained = 0;
        g_ucConnectionStatus = 0;


        //Initialize the SLHost Driver
        InitDriver();

	        char ssid[50];
	        int ssidlen = 0;
	        unsigned char mac[12];
	        SlSecParams_t pSecParams;
	        SlGetSecParamsExt_t pSecExtParams;
	        unsigned long pPriority = 0;
	        for (i = 0; i < 8; i++)
	        {
	        	if (sl_WlanProfileGet(i, ssid, &ssidlen, mac, &pSecParams, &pSecExtParams, &pPriority) >= 0)
	        		break;
	        }
	        ssid[ssidlen] = 0;
            if (ssid != NULL && ssidlen > 0 && !force_ap_mode)
            {
    	        Report("Profile SSID:%s\r\n", ssid);
    	        g_ucIpObtained = 0;
    	        g_ucConnectionStatus = 0;
            	Report("Auto Connect..\r\n");
            	sl_WlanSetMode(ROLE_STA);
                sl_Stop(SL_STOP_TIMEOUT);
                iDeviceMode =  sl_Start(NULL,NULL,NULL);
                Report("STA mode setup ready.\r\n");
                if (iDeviceMode == ROLE_STA)
                {
                  Report("Work in STA mode.\r\n");
                  auto_connect_mode = 1;
                }
                else
                  Report("STA mode switch failure.\r\n");
            }
        //Wait for Ip Acquired Event in AP Mode
        while(g_ucIpObtained == 0)
        {
            MAP_UtilsDelay(100); 
        }

         //
        // Wait for AP Configuraiton, Open Browser and Configure AP
        //
        while(g_ucProfileAdded && !g_ucProvisioningDone)
        {
            MAP_UtilsDelay(100); 
        }
		}

        g_ucProfileAdded = 1;
        //if (g_ucProvisioningDone && !auto_connect_mode)
        if (!auto_connect_mode)
        {
          Report("Switch to STA Mode\r\n");
        //Switch to STA Mode
        sl_WlanSetMode(ROLE_STA);
          
        //AP Configured, Restart in STA Mode
        DeInitDriverAP();
           
        g_ucIpObtained = 0;
        g_ucConnectionStatus = 0;

        //MAP_UtilsDelay(10000000); 
        InitDriver();
          Report("Connect to SSID:%s\r\n", g_cWlanSSID);
        //
        // Connect to the Configured Access Point
        //
        WlanConnect();
        }
        else if (auto_connect_mode)
        {
        	Report("Wait to auto connect..\r\n");
        	while(!g_ucConnectionStatus && !g_ucIpObtained)
        	{
        	  UtilsDelay(100);
        	}
        }
        g_ucConnectedToConfAP = g_ucConnectionStatus;

        //sl_WlanDisconnect();
        while (g_ucConnectedToConfAP)
        {
        	cloud_demo();
        }
        sl_WlanDisconnect();
    }

}


//****************************************************************************
//
//! Main function
//!
//! \param none
//! 
//! This function  
//!    1. Invokes the SLHost task
//!    2. Invokes the AP Provisioning Task
//!
//! \return None.
//
//****************************************************************************
void main()
{
    //
    // Setup the interrupt vector table
    //
#if defined(ewarm)
    MAP_IntVTableBaseSet((unsigned long)&__vector_table);
#endif
    
    //MCU Initialization
    PRCMCC3200MCUInit();

    MAP_IntMasterEnable();
    MAP_IntEnable(FAULT_SYSTICK);

    PinMuxConfig();
    GPIO_IF_LedConfigure(LED1|LED2|LED3);
    GPIO_IF_LedOff(MCU_ALL_LED_IND);

    Timer_IF_Init(PRCM_TIMERA0, TIMERA0_BASE, TIMER_CFG_PERIODIC, TIMER_A, 0);
    Timer_IF_Init(PRCM_TIMERA1, TIMERA1_BASE, TIMER_CFG_PERIODIC, TIMER_A, 0);

    // Setup the interrupts for the timer timeouts.
    Timer_IF_IntSetup(TIMERA0_BASE, TIMER_A, TimerBaseIntHandler);
    Timer_IF_IntSetup(TIMERA1_BASE, TIMER_A, TimerA1IntHandler);

    InitTerm();
    ClearTerm();

    //
    // I2C Init
    //
    I2C_IF_Open(I2C_MASTER_MODE_FST);

    //Init Temprature Sensor
    TMP006DrvOpen();

    //Init Accelerometer Sensor
    BMA222Open();

    // Turn on the timers
    Timer_IF_Start(TIMERA0_BASE, TIMER_A,
                    PERIODIC_TEST_CYCLES * PERIODIC_TEST_LOOPS / 10);
    Timer_IF_Start(TIMERA1_BASE, TIMER_A,
                    PERIODIC_TEST_CYCLES * PERIODIC_TEST_LOOPS / 40);


     //
    // Simplelinkspawntask
    //
    VStartSimpleLinkSpawnTask(SPAWN_TASK_PRIORITY);
    
    osi_TaskCreate(ProvisioningAP, (signed char*)"ProvisioningAP",
    		OSI_STACK_SIZE, NULL, APP_TASK_PRIORITY, NULL );
    
    osi_start();

    
}

//*****************************************************************************
//
// Close the Doxygen group.
//! @}
//
//*****************************************************************************
